let a1= "1) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.";
console.log(a1);
//1) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.
const aplle = ['a', 'b', 'c'];
console.log(aplle);
const citrus = [1, 2, 3];
console.log(citrus);
//==1=
const all = [aplle, citrus];
console.log(all);
//= 2 =
aplle.push(citrus);
console.log(aplle);
//=3=
const ne = aplle.concat([1, 2, 3]);
console.log(ne);
const ne1 = [].concat(aplle, citrus);
console.log(ne1);
//========================================
let a2= "2) Дан массив['a', 'b', 'c'].Добавьте ему в конец элементы 1, 2, 3.(через push и через splice)";
console.log(a2);
//2) Дан массив['a', 'b', 'c'].Добавьте ему в конец элементы 1, 2, 3.(через push и через splice)
let masPush = ['a', 'b', 'c'];
masPush.push("1", "2", "3");
console.log(masPush);
let masSplice = ['a', 'b', 'c'];
masSplice.splice(4, 0, "1", "2", "3");
console.log(masSplice);
//========================================
let a3= "3) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].";
console.log(a3);
//3) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].
let maSplice = ['1', '2', '3', '4', '5'];
maSplice.splice(1, 2,);
console.log(maSplice);
//=========================================
let a4= "4) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].";
console.log(a4);
//4) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
let aDelDobSplice = [1, 2, 3, 4, 5];
aDelDobSplice.splice(3, 0, 'a', 'b', 'c');
console.log(aDelDobSplice);
//=========================================
let a5 = "5) Дан массив const arr = [1, 2, 3, 4, 5]. Создать новый пустой массив arr1. Обойти массив arr через цикл for, каждый элемент массива arr умножить на 10 и результат положить в массив arr1.";
console.log(a5);
//5) Дан массив const arr = [1, 2, 3, 4, 5]. Создать новый пустой массив arr1.
//Обойти массив arr через цикл for, каждый элемент массива arr умножить на 10 и результат положить в массив arr1.
const arr = [1, 2, 3, 4, 5];

for(let i=0; i<arr.length; i++) {
    arr[i] *= 10;
};
let arr1 = arr;
console.log(arr1);
//===========================================
let a6 = "6) Вывести числа от 4 до 400 на экран.";
console.log(a6);
//6) Вывести числа от 4 до 400 на экран.
//=1=
let i = 3;
let result = '';
do {
    i++;//это=i+1//
    result += i;//это result+i//
}
while (i < 400);
console.log(result);
//-------------------------
//=2=
let resultF6 = 401;
for (let i = 4; i < resultF6; i++) {
    console.log(i)
}

//================================================
let a7 = "7) Вывести числа в последовательности: 4 7 10 13 с помощью цикла.";
console.log(a7);
//7) Вывести числа в последовательности: 4 7 10 13 с помощью цикла.
let ii = 1;
let result7 = '';
do { ii+=3; result7 += ii; }
while (ii < 13);
console.log(result7);
//===================================================
let a8 = "8) Вывести числа 654 653 652 до нуля.";
console.log(a8);
//8) Вывести числа 654 653 652 до нуля.
//=1=
let i8 = 655;
let result8 ='';
do { i8--; result8 += i8; }
while (i8>0);
console.log(result8);
//-------------------------------
//=2=
const resultF = -1;
for (let i = 654; i > resultF; i--) {
    console.log(i);
}
//===========================================

let a9 = "9) Вывести все годы с 1983 до 2017.";
console.log(a9);
//9) Вывести все годы с 1983 до 2017.
//=1=
let ii9 = 1982;
let result99 = '';
do { ii9++; result99 += ii9; }
while (ii9 < 2017);
console.log(result99);
//---------------------------------------
//=2=
const result9 = 2018;
for (let i9 = 1983; i9 < result9; i9++) {
    console.log(i9);
}


//==============================================
let a10 = "10) Вывести числа -4 -2 0 2 4 6 ...100.";
console.log(a10);
//10) Вывести числа -4 -2 0 2 4 6 ...100.
let i10 = -6;
let result10 = '';
do { i10+=2; result10 += i10; }
while (i10 < 100);
console.log(result10);
//=================================================
let a11 = "11) Найти сумму чисел от 0 до 100 (включительно). (0+1+2+3+4+5) ";
console.log(a11);
//11) Найти сумму чисел от 0 до 100 (включительно). (0+1+2+3+4+5)
let i11 = -1;
let result11 = [];
do {
    i11++; result11.push(i11);
}
while (i11 < 100);
// console.log(result11);
let resultAll = result11.reduce((sum, current)=> sum + current);
console.log(resultAll);
//----------------------------------
let a12 = "12) Заполните массив следующим образом: в первый элемент запишите 'x',во второй 'xx', в третий 'xxx' и так далее. Длину массива вводить через prompt.";
console.log(a12);
//12) Заполните массив следующим образом: в первый элемент запишите 'x',
// во второй 'xx', в третий 'xxx' и так далее. Длину массива вводить через prompt.
let chislo = prompt("Введите число-длина массива из Х-эл-тов", 0);
let ar = [];
let str = 'x';
for (let i = 0; i < chislo; i++) {
    ar.push(str);
    str += 'x';
}
console.log(ar);
//================================================
let a13 = "13) Заполните массив следующим образом: в первый элемент запишите '1', во второй '22', в третий '333' и так далее. Длину массива вводить через prompt";
console.log(a13);
//13) Заполните массив следующим образом: в первый элемент запишите '1',
// во второй '22', в третий '333' и так далее. Длину массива вводить через prompt
let chislo13 = prompt("Введите число-длина массива(кол-во эл-тов)", 0);
let result13 = [];
for (let i = 1; i <= chislo13; i++){
    let str = String(i);
    result13.push(str.repeat(i))
}
console.log(result13);